IDEA Connection Link
ConnectionLink.TestValidCSSInIDEADatabase Method
 Test method for valid rolled steel cross-section names in IDEA aplication
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void TestValidCSSInIDEADatabase(
	IList<string> testedNames,
	out IList<string> notValidNames
)
Public Sub TestValidCSSInIDEADatabase (
	testedNames As IList(Of String),
	<OutAttribute> ByRef notValidNames As IList(Of String)
)
public:
void TestValidCSSInIDEADatabase(
	IList<String^>^ testedNames,
	[OutAttribute] IList<String^>^% notValidNames
)
Parameters
testedNames
Type: System.Collections.Generic.IList<String>
Input list of rolled steel cross-section names for testing.
notValidNames
Type: System.Collections.Generic.IList<String>
Output list of not valid of rolled steel cross-section names.
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace